const colors = [
// 5 красных оттенков
    {hex: '#CC0000', category: 'Красный', name: 'Тёмно-красный'},
    {hex: '#CC1500', category: 'Красный', name: 'Красный-алый'},
    {hex: '#CC2900', category: 'Красный', name: 'Красно-оранжевый'},
    {hex: '#CC3D00', category: 'Красный', name: 'Тёмно-оранжевый'},
    {hex: '#CC5200', category: 'Красный', name: 'Оранжево-красный'},

    // 9 жёлто-оранжевых оттенков
    {hex: '#CC6600', category: 'Оранжевый', name: 'Оранжевый'},
    {hex: '#CC7A00', category: 'Оранжевый', name: 'Яркий оранжевый'},
    {hex: '#CC8F00', category: 'Оранжевый', name: 'Золотисто-оранжевый'},
    {hex: '#CCA300', category: 'Жёлто-оранжевый', name: 'Жёлто-оранжевый'},
    {hex: '#CCB800', category: 'Жёлто-оранжевый', name: 'Золотисто-жёлтый'},
    {hex: '#CCCC00', category: 'Жёлтый', name: 'Тёмно-жёлтый'},
    {hex: '#B8CC00', category: 'Жёлтый', name: 'Лимонно-жёлтый'},
    {hex: '#A3CC00', category: 'Жёлто-зелёный', name: 'Жёлто-зелёный'},
    {hex: '#8FCC00', category: 'Жёлто-зелёный', name: 'Лаймовый'},

    // 7 зелёных оттенков
    {hex: '#7ACC00', category: 'Зелёный', name: 'Светло-лаймовый'},
    {hex: '#66CC00', category: 'Зелёный', name: 'Яркий лайм'},
    {hex: '#52CC00', category: 'Зелёный', name: 'Кислотно-зелёный'},
    {hex: '#3DCC00', category: 'Зелёный', name: 'Неоновый зелёный'},
    {hex: '#29CC00', category: 'Зелёный', name: 'Ярко-зелёный'},
    {hex: '#15CC00', category: 'Зелёный', name: 'Изумрудно-зелёный'},
    {hex: '#00CC00', category: 'Зелёный', name: 'Тёмно-зелёный'}
];